In [1]:
import pandas as pd
import numpy as np

In [2]:
titanic_train = pd.read_csv("https://gist.githubusercontent.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/ff414a1bcfcba32481e4d4e8db578e55872a2ca1/titanic.csv",
                           sep='\t')   
titanic_train

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
151,152,1,1,"Pears, Mrs. Thomas (Edith Wearne)",female,22.0,1,0,113776,66.6000,C2,S
152,153,0,3,"Meo, Mr. Alfonzo",male,55.5,0,0,A.5. 11206,8.0500,NaN,S
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,NaN,S
155,156,0,1,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,NaN,C

In [8]:
labels = ['a', 'b', 'c']
my_data = [10,20,30]
arr = np.array(my_data)
print(arr)
d = {'a': 10, 'b': 20, 'c': 30}
print("Dictionary", d)
print("Labels ", labels)
print("data ", my_data)

[10 20 30]
Dictionary {'a': 10, 'b': 20, 'c': 30}
Labels  ['a', 'b', 'c']
data  [10, 20, 30]

In [9]:
pd.Series(my_data, labels)

a    10
b    20
c    30
dtype: int64

In [11]:
pd.Series(labels, index =my_data)

10    a
20    b
30    c
dtype: object

In [13]:
print("Holding numeric data" + '-'*20, sep="")
print(pd.Series(arr))

Holding numeric data--------------------
0    10
1    20
2    30
dtype: int32

In [14]:
print(pd.Series(arr)[2])

30

In [18]:
print("Holding text data " + "-" * 20)
pd.Series(labels)

Holding text data --------------------

0    a
1    b
2    c
dtype: object

In [22]:
d = {'a':"kjhk",'b':20,'c':30}

pd.DataFrame(d, index=['p', 'q', 'r', 's'])

      a   b   c
p  kjhk  20  30
q  kjhk  20  30
r  kjhk  20  30
s  kjhk  20  30

In [23]:
#Holding objects
print(pd.Series([type, sum, max]))

0             <class 'type'>
1    <built-in function sum>
2    <built-in function max>
dtype: object

In [27]:
ser1 = pd.Series([1,2,3,4], index = ['p', 'q', 'r', 's'])
print(ser1)

p    1
q    2
r    3
s    4
dtype: int64

In [28]:
ser2 = pd.Series([1,2,5,4],['CA', 'OR', 'NV', 'AZ'])
ser2

CA    1
OR    2
NV    5
AZ    4
dtype: int64

In [31]:
ser1[0:4:2]

p    1
r    3
dtype: int64

In [32]:
print("Value for CA in ser1:", ser1[0])
print("Value for AZ in ser1:", ser1[3])

Value for CA in ser1: 1
Value for AZ in ser1: 4

In [33]:
ser1 = pd.Series([1,2,3,4],['CA', 'OR', 'CO', 'CA'])
ser2 = pd.Series([1,2,5,4],['CA', 'NV', 'AZ','OR'])
print(ser1)
print(ser2)

CA    1
OR    2
CO    3
CA    4
dtype: int64
CA    1
NV    2
AZ    5
OR    4
dtype: int64

In [34]:
ser1 + ser2

AZ    NaN
CA    2.0
CA    5.0
CO    NaN
NV    NaN
OR    6.0
dtype: float64

In [35]:
print("\nPython tries to add values where it finds common index name, and puts NaN where indices are missing\n")

Python tries to add values where it finds common index name, and puts NaN where indices are missing

In [36]:
ser1 * ser2

AZ    NaN
CA    1.0
CA    4.0
CO    NaN
NV    NaN
OR    8.0
dtype: float64

In [38]:
ser1 = pd.Series([1,2,3,4],['CA', 'OR', 'CO', 'CA'])
ser2 = pd.Series([1,2,5,4],['CA', 'NV', 'AZ','CA'])
print(ser1)
print(ser2)
print(ser1 * ser2)

CA    1
OR    2
CO    3
CA    4
dtype: int64
CA    1
NV    2
AZ    5
CA    4
dtype: int64
AZ     NaN
CA     1.0
CA     4.0
CA     4.0
CA    16.0
CO     NaN
NV     NaN
OR     NaN
dtype: float64

In [50]:
from numpy.random import randn as rdn
np.random.seed(101)
matrix = rdn(5,4)
rowlabels = ['A', 'B','C', 'D', 'E']
collabels = ['P', 'Q', 'R', 'S']
df = pd.DataFrame(matrix, rowlabels, collabels)

In [51]:
df

          P         Q         R         S
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [52]:
df.iloc[2]

P   -2.018168
Q    0.740122
R    0.528813
S   -0.589001
Name: C, dtype: float64

In [58]:
df.iloc[2,2]

0.5288134940893595

In [59]:
#   0.740122	0.528813	
#  -0.758872	-0.933237	

df.iloc[2:4, 1:3]

          Q         R
C  0.740122  0.528813
D -0.758872 -0.933237

In [56]:
df[['P', 'Q']]

          P         Q
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

In [60]:
print("\nThe 'X' column accessed by DOT method (NOT recommended)\n",'-'*55, sep='')

The 'X' column accessed by DOT method (NOT recommended)
-------------------------------------------------------

In [64]:
print("\nA column is created by assigning it in relation to an existing column\n",'-'*75, sep='')

df["newCol"] = df["R"] + df['S']

A column is created by assigning it in relation to an existing column
---------------------------------------------------------------------------

In [65]:
df

          P         Q         R         S    newCol
A  2.706850  0.628133  0.907969  0.503826  1.411795
B  0.651118 -0.319318 -0.848077  0.605965 -0.242112
C -2.018168  0.740122  0.528813 -0.589001 -0.060187
D  0.188695 -0.758872 -0.933237  0.955057  0.021819
E  0.190794  1.978757  2.605967  0.683509  3.289476

In [66]:
df.drop("A")

          P         Q         R         S    newCol
B  0.651118 -0.319318 -0.848077  0.605965 -0.242112
C -2.018168  0.740122  0.528813 -0.589001 -0.060187
D  0.188695 -0.758872 -0.933237  0.955057  0.021819
E  0.190794  1.978757  2.605967  0.683509  3.289476

In [68]:
df.drop("newCol", axis=1, inplace=True)

In [69]:
df

          P         Q         R         S
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [70]:
df.iloc[2]

P   -2.018168
Q    0.740122
R    0.528813
S   -0.589001
Name: C, dtype: float64

In [72]:
#multiple rows
df.iloc[1:3]

          P         Q         R         S
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001

In [75]:
df.iloc[[1, 3],[0,2]]

          P         R
B  0.651118 -0.848077
D  0.188695 -0.933237

In [77]:

matrix_data = rdn(5,4)
row_labels = ['A','B','C','D','E']
column_headings = ['W','X','Y','Z']
df = pd.DataFrame(data=matrix_data, index=row_labels, columns=column_headings)

In [78]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [80]:
print("\nElement at row 'B' and column 'Y' is\n") 

df.loc["B", 'Y']

Element at row 'B' and column 'Y' is

0.16690463609281317

In [81]:
df.loc[["B", "D"], ["X", "Z"]]

          X         Z
B  0.390528  0.184502
D -0.754070  0.484752

In [82]:
df.loc[["B", "D"]]

          W         X         Y         Z
B -0.134841  0.390528  0.166905  0.184502
D -0.497104 -0.754070 -0.943406  0.484752

In [83]:
df[df>0]

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

In [84]:
df[df["W"]>0]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [85]:
df["W"][df["W"]>0]

A    0.302665
C    0.807706
Name: W, dtype: float64

In [89]:
matrix_data = np.matrix('22,33,230; 12,24,140; 14,15,231; 16,25,160')
matrix_data
row_labels = ['A','B','C','D']
column_headings = ['Age', 'Height', 'Weight']
df = pd.DataFrame(matrix_data, index= row_labels, columns = column_headings )

In [90]:
df

   Age  Height  Weight
A   22      33     230
B   12      24     140
C   14      15     231
D   16      25     160

In [91]:
df[df["Height"] > 20]

   Age  Height  Weight
A   22      33     230
B   12      24     140
D   16      25     160

In [92]:
df["Height"]>20

A     True
B     True
C    False
D     True
Name: Height, dtype: bool

In [97]:
df[(df["Height"]>20) & (df["Weight"]>150)]

   Age  Height  Weight
A   22      33     230
D   16      25     160

In [98]:
df

   Age  Height  Weight
A   22      33     230
B   12      24     140
C   14      15     231
D   16      25     160

In [99]:
df.reset_index()

  index  Age  Height  Weight
0     A   22      33     230
1     B   12      24     140
2     C   14      15     231
3     D   16      25     160

In [100]:
df.reset_index(drop=True)

   Age  Height  Weight
0   22      33     230
1   12      24     140
2   14      15     231
3   16      25     160

In [101]:
df["Profession"] = "Student teacher doctor engineer".split()

In [102]:
df

   Age  Height  Weight Profession
A   22      33     230    Student
B   12      24     140    teacher
C   14      15     231     doctor
D   16      25     160   engineer

In [103]:
#set profession as index

df.reset_index()

  index  Age  Height  Weight Profession
0     A   22      33     230    Student
1     B   12      24     140    teacher
2     C   14      15     231     doctor
3     D   16      25     160   engineer

In [104]:
df.set_index("Profession")

            Age  Height  Weight
Profession
Student      22      33     230
teacher      12      24     140
doctor       14      15     231
engineer     16      25     160

In [108]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
heir_index = list(zip(outside, inside))
heir_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [110]:
heir_index1 = pd.MultiIndex.from_tuples(heir_index)

In [111]:
heir_index1

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [112]:
hier_index = pd.MultiIndex.from_tuples(heir_index)
print("\nIndex hierarchy\n",'-'*25, sep='')
print(hier_index)

Index hierarchy
-------------------------
MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [113]:
type(hier_index)

pandas.core.indexes.multi.MultiIndex

In [123]:
np.random.seed(101)
rdn(6, 4)

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889],
       [ 0.30266545,  1.69372293, -1.70608593, -1.15911942]])

In [124]:
np.random.seed(101)
df=pd.DataFrame(rdn(6,4), index= hier_index, columns = ["A", "B", "C", "D"])

In [125]:
df

             A         B         C         D
G1 1  2.706850  0.628133  0.907969  0.503826
   2  0.651118 -0.319318 -0.848077  0.605965
   3 -2.018168  0.740122  0.528813 -0.589001
G2 1  0.188695 -0.758872 -0.933237  0.955057
   2  0.190794  1.978757  2.605967  0.683509
   3  0.302665  1.693723 -1.706086 -1.159119

In [126]:
#cross section

df.xs("G1")

          A         B         C         D
1  2.706850  0.628133  0.907969  0.503826
2  0.651118 -0.319318 -0.848077  0.605965
3 -2.018168  0.740122  0.528813 -0.589001